---
kind: method
id: M:Autodesk.Revit.DB.CitySet.Clear
source: html/38ef1e44-d124-c058-60a9-6df0b9314869.htm
---
# Autodesk.Revit.DB.CitySet.Clear Method

Removes every city from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```